# Yosys TCL Script for ALU Synthesis (Standard Verilog)

# Read the Verilog source
read_verilog ../../rtl/register_file.v

# Specify the top module
hierarchy -check -top register_file

# Perform synthesis
proc; opt; fsm; opt; memory; opt; techmap; opt;

# Write the synthesized netlist
write_verilog build/register_file_synth.v

# Write a report
stat

# Optionally, print the hierarchy of the design
hierarchy -top register_file
