# Yosys TCL Script for ALU Synthesis (Standard Verilog)

# Read the Verilog source
read_verilog ../../rtl/imm_gen.v

# Specify the top module
hierarchy -check -top imm_gen

# Perform synthesis
proc; opt; fsm; opt; memory; opt; techmap; opt;

# Write the synthesized netlist
write_verilog build/imm_gen_synth.v

# Write a report
stat

# Optionally, print the hierarchy of the design
hierarchy -top imm_gen
