# Yosys TCL Script for ALU Synthesis (Standard Verilog)

# Read the Verilog source
read_verilog ../../rtl/instruction_mem.v

# Specify the top module
hierarchy -check -top instruction_mem

# Perform synthesis
proc; opt; fsm; opt; memory; opt; techmap; opt;

# Write the synthesized netlist
write_verilog build/instruction_mem_synth.v

# Write a report
stat

# Optionally, print the hierarchy of the design
hierarchy -top instruction_mem
